COLOR_EMOJIS = {
    "red": "🔴",
    "black": "⚫️",
    "green": "🟢"
}

COLOR_MAP = {
    # Красный
    "красное": "red",
    "красный": "red",
    "к": "red",
    "red": "red",

    # Чёрный / черный
    "чёрное": "black",
    "черное": "black",
    "чёрный": "black",
    "черный": "black",
    "ч": "black",
    "black": "black",

    # Зелёный / зеленый
    "зелёное": "green",
    "зеленое": "green",
    "зелёный": "green",
    "зеленый": "green",
    "зел": "green",
    "з": "green",
    "green": "green",
}

BET_ALL_IN = {"allin", "all-in", "all in", "all_in", "все", "всё"}
